Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The PAR endpoint is discovered from the OAuth Authorization Server Metadata parameter `pushed_authorization_request_endpoint`. If the metadata discovery is disabled, you must configure the PAR endpoint manually, as shown below:
ja_jp: PAR エンドポイントは、OAuth Authorization Server Metadata パラメーター `pushed_authorization_request_endpoint` から検出されます。 メタデータディスカバリーが無効になっている場合は、以下の例のように PAR エンドポイントを手動で設定する必要があります。

source: The PMML file describes the prediction logic of our microservice. It should provide the actual model (Regression, Tree, Scorecard, Clustering, etc) needed to make the prediction.
ja_jp: PMMLファイルには、マイクロサービスの予測ロジックが記述されています。 予測に必要な実際のモデル(回帰、ツリー、スコアカード、クラスタリングなど)を提供する必要があります。

source: The PMML file describes the prediction logic of our microservice. It should provide the actual model (Regression, Tree, Scorecard, Clustering, etc.) needed to make the prediction.
ja_jp: PMMLファイルにはマイクロサービスの予測ロジックが記述されています。 予測に必要な実際のモデル(回帰、ツリー、スコアカード、クラスタリングなど)を提供する必要があります。

source: The POJO Codec
ja_jp: POJO codec

source: The POJO Codec have enhanced generic support via `PropertyCodecProvider`, Quarkus will automatically register any `PropertyCodecProvider` with the POJO Codec (these classes are automatically made CDI beans of `@Singleton` scope). When building native executables and using generic types, you might need to register the type arguments for reflection.
ja_jp: POJO Codecでは、 `PropertyCodecProvider` によるジェネリックサポートが強化されています。Quarkusでは、POJO Codecで `PropertyCodecProvider` を使用すると自動的に登録されます（これらのクラスは自動的に `@Singleton` スコープのCDI Beanになります）。ネイティブ実行可能ファイルをビルドしてジェネリック型を使用する場合、リフレクションのために型の引数を登録する必要があるかもしれません。

source: The Panache Query Language, which is a superset of the Hibernate Query Language adding very few shortcuts, which is supported in all the `PanacheRepository` queries.
ja_jp: Panache Query Language は、Hibernate Query Language のスーパーセットであり、ごくわずかなショートカットを追加したもので、すべての `PanacheRepository` クエリでサポートされています。

source: The Pipeline Implementation
ja_jp: パイプラインの実装

source: The Podman package is available in several Linux distributions. Podman can be used the same way as Docker with the `podman-docker` package. To install it for your OS, please refer to the https://podman.io/getting-started/installation[Podman installation guide]. Below is the short installation instruction for popular Linux distributions:
ja_jp: Podman パッケージはいくつかの Linux ディストリビューションで利用可能です。Podman は `podman-docker` パッケージで Docker と同じように使うことができます。ご使用の OS にインストールするには、 https://podman.io/getting-started/installation[Podman インストールガイド] を参照してください。以下は、一般的な Linux ディストリビューションでの簡単なインストール方法です。

source: The Podman package is available in several Linux distributions. Podman can in most cases be used as an drop-in-replacement for Docker, either with the `podman-docker` package, or using an alias (`alias docker=podman`). To install it for your Linux OS, please refer to the https://podman.io/getting-started/installation#installing-on-linux[Podman installation guide].
ja_jp: PodmanパッケージはいくつかのLinuxディストリビューションで利用可能です。 `podman-docker`パッケージを使用するか、エイリアス（`alias docker=podman`）を使用することで、Podmanはほとんどの場合、Dockerの代替品として使用することができます。 Linux OSにインストールするには、 https://podman.io/getting-started/installation#installing-on-linux[Podmanインストールガイド]を参照してください。

source: The PojoCodecProvider: easy object to BSON document conversion.
ja_jp: PojoCodecProvider: オブジェクトからBSONドキュメントへの変換を簡単に行うことができます。

source: The Polaris team has learned a lot so far on their application journey with Quarkus. They have some helpful advice to others who are considering using Quarkus.
ja_jp: Polarisチームは、Quarkusを使ったアプリケーションの旅でこれまでに多くのことを学びました。彼らは、Quarkusの使用を検討している他の人々に有益なアドバイスをしています。

source: The Polaris team was also impressed by the Quarkus community especially when compared to alternative communities because of its vibrant activity, release cadence, native compilation capability, and more.
ja_jp: また、Polarisチームは、Quarkusコミュニティの活発な活動、リリースケイデンス、ネイティブコンパイル機能など、他のコミュニティと比較して特にQuarkusコミュニティに感銘を受けました。

source: The PostgreSQL and MariaDB/MySQL clients can be configured to connect to the server through a UNIX domain socket.
ja_jp: PostgreSQL および MariaDB/MySQL クライアントは、UNIX ドメインソケットを介してサーバーに接続するように設定できます。

source: The PostgreSQL and MariaDB/MySQL clients support pipelining of queries at the connection level. The feature consists in sending multiple queries on the same database connection without waiting for the corresponding responses.
ja_jp: PostgreSQL および MariaDB/MySQL クライアントは、接続レベルでのクエリーのパイプライン化をサポートしています。 この機能には、対応する応答を待たずに、同じデータベース接続で複数のクエリーを送信する機能などが含まれます。

source: The Power of the Quarkiverse Ecosystem
ja_jp: Quarkiverse エコシステムの力

source: The Protobuf Schema that will be generated and used both on client and Infinispan Server side, will have the following content:
ja_jp: Protobuf Schemaは、生成され、クライアント側とInfinispanサーバー側の両方で使用され、以下のような内容になります:

source: The Protocol Buffers specification provides a way to import `proto` files. The Quarkus code generation mechanism lets you control the scope of dependencies to scan for possible imports by setting the `quarkus.generate-code.grpc.scan-for-imports` property in your `application.properties`. You can set it to one of the following values:
ja_jp: Protocol Buffers 仕様では、 `proto` ファイルをインポートする方法が提供されています。 Quarkus コード生成メカニズムを使用すると、 `application.properties` で `quarkus.generate-code.grpc.scan-for-imports` プロパティーを設定することで、可能なインポートをスキャンする依存関係の範囲を制御できます。 以下のいずれかの値に設定できます。

source: The Proxy Registry automatically retrieves the credentials. The credentials are applied to the proxy configuration.
ja_jp: プロキシーレジストリーはクレデンシャルを自動的に取得し、プロキシー設定に適用します。

source: The Pulsar Connector allows configuring Schema configuration for the underlying Pulsar consumer. See the <<pulsar-schema-configuration>> for more information.
ja_jp: Pulsar コネクターを使用すると、基盤となる Pulsar コンシューマーのスキーマ設定を設定できます。 詳細は、<<pulsar-schema-configuration>> を参照してください。

source: The Pulsar Connector allows configuring Schema configuration for the underlying Pulsar producer. See the <<pulsar-schema-configuration>> for more information.
ja_jp: Pulsar コネクターを使用すると、基盤となる Pulsar プロデューサーのスキーマ設定を設定できます。 詳細は、<<pulsar-schema-configuration>> を参照してください。

source: The Pulsar Connector allows configuring complex schema types by providing `Schema` beans through CDI, identified with the `@Identifier` qualifier.
ja_jp: Pulsar コネクターを使用すると、 `@Identifier` 修飾子で識別される `Schema` Bean を CDI を通じて提供することで、複雑なスキーマタイプを設定できます。

source: The Pulsar Connector allows specifying the schema as a primitive type using the `schema` property:
ja_jp: Pulsar コネクターでは、 `schema` プロパティーを使用してスキーマをプリミティブ型として指定できます。

source: The Pulsar Connector can write Reactive Messaging Messages as Pulsar Message.
ja_jp: Pulsar コネクターは、Reactive Messaging メッセージを Pulsar メッセージとして書き込むことができます。

source: The Pulsar Connector can write Reactive Messaging `Message`s as Pulsar Message.
ja_jp: Pulsar Connectorはリアクティブ・メッセージング `Message` をPulsarメッセージとして書き込むことができます。

source: The Pulsar Connector connects to a Pulsar broker using a Pulsar client and creates consumers to receive messages from Pulsar brokers, and it maps each Pulsar `Message` into Reactive Messaging `Message`.
ja_jp: Pulsar コネクターは、Pulsar クライアントを使用して Pulsar ブローカーに接続し、コンシューマーを作成して Pulsar ブローカーからメッセージを受信します。また、各 Pulsar `Message` を Reactive Messaging `Message` にマッピングします。

source: The Pulsar Dev Service will be enabled when the `quarkus-messaging-pulsar` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:pulsar-dev-services.adoc[Pulsar Dev Services Guide].
ja_jp: Pulsar Devサービスは、 `quarkus-messaging-pulsar` エクステンションがアプリケーションに存在し、ブローカー・アドレスが明示的に設定されていない場合に有効になります。 詳細は xref:pulsar-dev-services.adoc[Pulsar Dev Services ガイド] をご覧ください。

source: The Pulsar Dev Service will be enabled when the `quarkus-smallrye-reactive-messaging-pulsar` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:pulsar-dev-services.adoc[Pulsar Dev Services Guide].
ja_jp: Pulsar Dev Serviceは、 `quarkus-smallrye-reactive-messaging-pulsar` エクステンションがアプリケーションに存在し、ブローカー・アドレスが明示的に設定されていない場合に有効になります。 詳細は xref:pulsar-dev-services.adoc[Pulsar Dev Services Guide] をご覧ください。

source: The Pulsar client automatically retries sending messages in case of failure, until the *send timeout* is reached. The *send timeout* is configurable with `sendTimeoutMs` attribute and by default is 30 seconds.
ja_jp: Pulsar クライアントは、失敗した場合に、 *送信タイムアウト* に達するまで、自動的にメッセージの送信を再試行します。 *送信タイムアウト* は、 `sendTimeoutMs` 属性で設定可能で、デフォルトでは 30 秒です。

source: The Pulsar client dns lookup bind address, default behavior is bind on 0.0.0.0
ja_jp: PulsarクライアントのDNSルックアップバインド・アドレス、デフォルトの動作は0.0.0.0にバインドされます。

source: The Pulsar client dns lookup bind port, takes effect when dnsLookupBindAddress is configured, default value is 0.
ja_jp: dnsLookupBindAddressが構成されている場合に有効となります。デフォルト値は0です。

source: The Pulsar connector creates a Pulsar client and, a consumer or a producer per channel, each with sensible defaults to ease their configuration. Although the creation is handled, all available configuration options remain configurable through Pulsar channels.
ja_jp: Pulsar コネクターは、Pulsar クライアントと、チャネルごとのコンシューマーまたはプロデューサーを作成します。それぞれに実用的なデフォルトが設定されているため、設定が容易です。 作成は処理されますが、利用できる設定オプションは、すべて Pulsar チャネルを通じて設定可能です。

source: The Pulsar connector for Reactive Messaging
ja_jp: リアクティブメッセージング用の Pulsar コネクター

source: The Pulsar outbound connector handles back-pressure, monitoring the number of pending messages waiting to be written to the Pulsar broker. The number of pending messages is configured using the `maxPendingMessages` attribute and defaults to 1000.
ja_jp: Pulsar 発信コネクターは、バックプレッシャーを処理し、Pulsar ブローカーへの書き込みを待機している保留メッセージの数を監視します。 保留メッセージの数は、 `maxPendingMessages` 属性を使用して設定され、デフォルトは 1000 です。

source: The Pulsar schema type of this channel. When configured a schema is built with the given SchemaType and used for the channel. When absent, the schema is resolved searching for a CDI bean typed `Schema` qualified with `@Identifier` and the channel name. As a fallback AUTO_CONSUME or AUTO_PRODUCE are used.
ja_jp: このチャネルのPulsarスキーマ・タイプ。構成されると、指定されたSchemaTypeでスキーマが構築され、チャネルに使用されます。指定されていない場合、スキーマは `@Identifier` とチャネル名で修飾されたCDI Bean型 `Schema` を検索して解決されます。フォールバックとして AUTO_CONSUME または AUTO_PRODUCE が使用されます。

source: The Quarkiverse Hub is a home for community-maintained extensions. Among other things, it provides a nice infrastructure for building and releasing extensions and also for hosting documentation.
ja_jp: Quarkiverse Hubは、コミュニティで維持されているエクステンションのホームです。とりわけ、エクステンションのビルドやリリース、ドキュメントのホスティングのための優れたインフラを提供しています。

source: The Quarkus 1.x platform was based on a single BOM - `io.quarkus:quarkus-universe-bom`, that would be imported by Quarkus applications. The universe BOM would include all the Quarkus platform extensions plus their dependencies. BOMs are meant to make it easy to align common dependencies on versions that work for all the libraries and frameworks used in an application. However, badly composed BOMs may actually make it very difficult or practically impossible to achieve that. Generally speaking, the wider the scope of the dependencies a BOM manages, the higher the risk of running into incompatiblity issues when users include libraries that aren't managed by the BOM into their applications.
ja_jp: Quarkus 1.xプラットフォームは、Quarkusアプリケーションによってインポートされる単一のBOM（ `io.quarkus:quarkus-universe-bom` ）に基づいていました。ユニバースのBOMには、すべてのQuarkusプラットフォームのエクステンションとその依存関係が含まれています。BOMは、アプリケーションで使用されるすべてのライブラリやフレームワークで動作するバージョンに、共通の依存関係を簡単に揃えることを目的としています。しかし、BOMの構成が悪いと、実際にはそれを達成するのが非常に難しいか、実質的に不可能になることがあります。一般的に、BOMが管理する依存関係の範囲が広ければ広いほど、ユーザーがBOMで管理されていないライブラリをアプリケーションに組み込む際に非互換性の問題が発生するリスクが高くなります。

source: The Quarkus Application configuration file is loaded from the classpath resources, for instance `src/main/resources/application.properties`, `src/test/resources/application.properties` or from a `jar` dependency that contains an `application.properties` entry. Each `application.properties` found is treated as a separate `ConfigSource` and follow the same rules as every other source (override per property). Additionally, the configuration file may also reside in `$PWD/config/application.properties`. The loading starts from the config folder and then classpath order (`application.properties` files in the application sources will have priority on the classloader loading order).
ja_jp: Quarkus アプリケーション設定ファイルは、クラスパスリソース (たとえば、 `src/main/resources/application.properties`、 `src/test/resources/application.properties`) から、または `application.properties` エントリーが含まれる `jar` 依存関係から読み込まれます。見つかった各 `application.properties` は個別の `ConfigSource` として扱われ、他のすべてのソースと同じルールに従います (プロパティーごとのオーバーライド)。さらに、設定ファイルは `$PWD/config/application.properties` に存在する場合もあります。読み込みは config フォルダーから始まり、次にクラスパスの順序になります (アプリケーションソース内の `application.properties` ファイルがクラスローダー読み込み順序で優先されます)。

source: The Quarkus CLI allows building container images without tampering with your project configuration (adding / removing container image extensions). To build the image for your project:
ja_jp: Quarkus CLI を使用すると、プロジェクト設定を変更せずに (コンテナーイメージエクステンションの追加/削除) コンテナーイメージをビルドできます。 プロジェクトのイメージをビルドするには、以下を実行します。

source: The Quarkus CLI can add Quarkus one or more extensions to your project with the 'add' command:
ja_jp: Quarkus CLIでは、'add'コマンドを使用して、プロジェクトにQuarkusのエクステンションを1つまたは複数追加できます：

source: The Quarkus CLI can add one or more extensions to your project with the `add` subcommand:
ja_jp: Quarkus CLI では、 `add` サブコマンドを使用してプロジェクトに 1 つ以上のエクステンションを追加できます。

source: The Quarkus CLI can remove one or more extensions from your project with the 'remove' command:
ja_jp: Quarkus CLIでは、 'remove' コマンドを使用して、プロジェクトから1つまたは複数のエクステンションを削除できます：

source: The Quarkus CLI can remove one or more extensions from your project with the `remove`/`rm` subcommand:
ja_jp: Quarkus CLI では、 `remove`/`rm` サブコマンドを使用して、プロジェクトから 1 つ以上のエクステンションを削除できます。

source: The Quarkus CLI is available as a jar installable using https://jbang.dev[JBang].
ja_jp: Quarkus CLI は、 https://jbang.dev[JBang] を使用してインストール可能な jar として利用できます。

source: The Quarkus CLI is available in several developer-oriented package managers such as:
ja_jp: Quarkus CLI は、以下のようないくつかの開発者向けのパッケージマネージャーで利用できます。

source: The Quarkus CLI is maturing and we are now publishing it in more places:
ja_jp: QuarkusのCLIは成熟してきており、より多くの場所で公開しています。

source: The Quarkus CLI is now extensible with plugins. See details in the https://quarkus.io/version/main/guides/cli-tooling#extending-the-cli[CLI guide].
ja_jp: Quarkus CLIは、プラグインで拡張できるようになりました。詳細は、 link:https://quarkus.io/version/main/guides/cli-tooling#extending-the-cli[CLIガイド] をご覧ください。

source: The Quarkus CLI was made extensible with plugins. Expect a lot of new features in the Quarkus CLI in the form of plugins in the near future.
ja_jp: Quarkus CLIは、プラグインによって拡張可能になりました。近い将来、プラグインの形でQuarkus CLIに多くの新機能が追加されるでしょう。

source: The Quarkus CLI, it is still experimental, and we don't provide an installer yet. Still, you can easily try it using the amazing https://jbang.dev/[JBang,role=external,window=_blank]
ja_jp: Quarkus CLIは、まだ実験的なもので、インストーラーはまだ提供されていません。それでも、素晴らしい https://jbang.dev/[JBang, role=external, window=_blank]を使って簡単に試すことができます。

source: The Quarkus CLI:
ja_jp: Quarkus CLI

source: The Quarkus Chicory extension provides the `WasmQuarkusContext` API for injection, to access configured WASM modules. Here's how we use it in our service:
ja_jp: Quarkus Chicory エクステンションは、設定された WASM モジュールにアクセスするためのインジェクション用 `WasmQuarkusContext` API を提供します。サービスでの使用方法は次のとおりです。

source: The Quarkus Dev Assistant is an AI-powered helper built directly into Quarkus Dev Mode. Its goal is to make you more productive by helping you troubleshoot and assisting with development tasks.
ja_jp: Quarkus Dev Assistant は、 Quarkus 開発モードに直接組み込まれた AI 駆動のヘルパーです。トラブルシューティングを支援し、開発タスクをサポートすることで、生産性を向上させることを目的としています。

source: The Quarkus DevUI now includes support for the topology visualizer, which looks like link:https://user-images.githubusercontent.com/593564/136768958-9a66c25b-c3fa-4a6c-9211-8cedd845eb55.png[this example].
ja_jp: Quarkus DevUIでは、 link:https://user-images.githubusercontent.com/593564/136768958-9a66c25b-c3fa-4a6c-9211-8cedd845eb55.png[このような]トポロジービジュアライザーのサポートが追加されました。

source: The Quarkus Gradle plugin cares about _what_ is cached _in which environment_ (CI or local development). Big artifacts like uber-jars and native binaries are not cached in CI, but are cached in local development environments.
ja_jp: Quarkus Gradle プラグインは、_何_ が、_どの環境_ (CI またはローカル開発) にキャッシュされているかを考慮します。uber-jar やネイティブバイナリーなどの大きなアーティファクトは CI ではキャッシュされませんが、ローカル開発環境ではキャッシュされます。

source: The Quarkus Gradle plugin detects a _CI environment_, if the `CI` environment variable is present.
ja_jp: Quarkus Gradleプラグインは、 `CI` 環境変数が存在する場合、 _CI環境_ を検出します。

source: The Quarkus Gradle plugin is published to the https://plugins.gradle.org/plugin/io.quarkus[Gradle Plugin Portal].
ja_jp: Quarkus Gradle プラグインは、Gradle link:https://plugins.gradle.org/plugin/io.quarkus[プラグインポータル] に公開されています。

source: The Quarkus Gradle plugin uses the "standard" Quarkus mechanisms to load and parse configurations. Support for `application.(yaml|yml)` has been added in Quarkus 3.0 in addition to `application.properties`. Also new in 3.0 is that all mechanisms available via SmallRye Config, are implicitly also now available for the Quarkus Gradle plugin.
ja_jp: Quarkus Gradleプラグインは、設定の読み込みと解析に"標準"のQuarkusのメカニズムを使用します。Quarkus 3.0では、 `application.properties` に加えて、 `application.(yaml|yml)` のサポートが追加されました。また、3.0では、SmallRye Configで利用できるすべてのメカニズムが、暗黙のうちにQuarkus Gradleプラグインでも利用できるようになっています。

source: The Quarkus Gradle plugin works with builds that have the link:https://docs.gradle.org/current/userguide/configuration_cache.html[Gradle's configuration cache] enabled, but the configuration cache is disabled for some of the Quarkus tasks. This means, that the Quarkus plugin does not break such Gradle builds. The current state of compatibility is shown in the following table:
ja_jp: Quarkus Gradle プラグインは、 link:https://docs.gradle.org/current/userguide/configuration_cache.html[Gradle の設定キャッシュ] を有効にしているビルドで動作しますが、一部の Quarkus タスクでは設定キャッシュが無効になっています。これは、Quarkus プラグインがそのような Gradle ビルドを壊さないことを意味します。現在の互換性の状態は、次の表に示されています。

source: The Quarkus Gradle plugin works with builds that have the link:https://docs.gradle.org/current/userguide/configuration_cache.html[Gradle's configuration cache] enabled, but the configuration cache is disabled for the Quarkus tasks. This means, that the Quarkus plugin does not break such Gradle builds.
ja_jp: Quarkus Gradleプラグインは、 link:https://docs.gradle.org/current/userguide/configuration_cache.html[Gradleの設定キャッシュ] を有効にしているビルドで動作しますが、Quarkusタスクでは設定キャッシュは無効になっています。つまり、Quarkusプラグインは、そのようなGradleビルドを壊さないということです。

source: The Quarkus HTTP port will be 9090. If the `dev` profile is active it will be 8181.
ja_jp: Quarkus HTTP ポートは 9090 になります。 `dev` プロファイルがアクティブな場合、8181 になります。

source: The Quarkus Infinispan client extension allows for Dependency Injection of the `CounterManager` directly. All you need to do is annotate your field, constructor or method and you get it with no fuss. You can then use counters as you would normally.
ja_jp: Quarkus Infinispanクライアントエクステンションを使用すると、 `CounterManager` の依存性注入を直接行えます。必要なのは、フィールド、コンストラクタ、メソッドにアノテーションを付けるだけで、手間をかけずに注入できます。そして、通常のようにカウンターを使用できます。

source: The Quarkus Infinispan client extension allows for Dependency Injection of the `CounterManager` directly. All you need to do is annotate your field, constructor or method, and you get it with no fuss. You can then use counters as you would normally.
ja_jp: Quarkus Infinispan クライアントエクステンションでは、 `CounterManager` を直接依存性注入することができます。フィールド、コンストラクタ、メソッドにアノテーションを付けるだけで、簡単に取得できます。そして、通常と同じようにカウンタを使用することができます。

source: The Quarkus JBeret Extension adds support for JSR-352 Batch Applications for the Java Platform. JBeret is an implementation of the JSR-352.
ja_jp: Quarkus JBeret Extension は、Java Platform 用の JSR-352 バッチアプリケーションのサポートを追加します。JBeret は JSR-352 の実装です。

source: The Quarkus JFR extension provides a Request ID for event association. See <<identifying-requests>> for more information on Request IDs.
ja_jp: Quarkus JFR エクステンションは、イベントの関連付けのためのリクエスト ID を提供します。 リクエスト ID の詳細は、<<identifying-requests>> を参照してください。

source: The Quarkus JFR extension separates the public API from the runtime implementation. As a result, other extensions can implement JFR-based instrumentation by depending only on the JFR API module, without adding a dependency on the Quarkus JFR extension implementation itself.
ja_jp: Quarkus JFR エクステンションは、パブリック API をランタイム実装から分離します。その結果、他のエクステンションは JFR API モジュールのみに依存することで、Quarkus JFR エクステンションの実装自体に依存関係を追加することなく、JFR ベースのインストルメンテーションを実装できます。

source: The Quarkus JaCoCo config only works for tests that are annotated with `@QuarkusTest` and `@QuarkusUnitTest`. If you want to check the coverage of other tests as well then you will need to fall back to the JaCoCo maven plugin, see https://quarkus.io/guides/tests-with-coverage#coverage-for-tests-not-using-quarkustest[the docs] for more information.
ja_jp: Quarkus の JaCoCo 設定は、`@QuarkusTest` または `@QuarkusUnitTest` のアノテーションが付いたテストに対してのみ機能します。それ以外のテストのカバレッジも確認したい場合は、JaCoCo Maven プラグインにフォールバックする必要があります。詳細については、https://quarkus.io/guides/tests-with-coverage#coverage-for-tests-not-using-quarkustest[ドキュメント]を参照してください。

source: The Quarkus Keycloak Admin Client and its reactive twin support Keycloak Admin Client which can be used to configure a running Keycloak server.
ja_jp: Quarkus Keycloak Admin Clientとそのreactiveの2つは、実行中のKeycloakサーバーを設定するために使用できるKeycloak Admin Clientをサポートしています。

source: The Quarkus Kotlin extension already declares a dependency on some base Kotlin libraries like `kotlin-stdlib-jdk8` and `kotlin-reflect`. The Kotlin version of these dependencies is declared in the Quarkus BOM and is currently at {kotlin-version}. It is therefore recommended to use the same Kotlin version for other Kotlin libraries. When adding a dependency to another base Kotlin library (e.g. `kotlin-test-junit5`) you don't need to specify the version, since the Quarkus BOM includes the link:https://search.maven.org/artifact/org.jetbrains.kotlin/kotlin-bom[Kotlin BOM].
ja_jp: QuarkusのKotlinエクステンションは、すでに `kotlin-stdlib-jdk8` や `kotlin-reflect` などの一部のKotlinベースライブラリへの依存を宣言しています。これらの依存関係のKotlinバージョンは、Quarkus BOMで宣言されており、現在のバージョンは{kotlin-version}です。したがって、他のKotlinライブラリには、同じKotlinバージョンを使用することをお勧めします。他のベースKotlinライブラリに依存性を追加する場合（たとえば、 `kotlin-test-junit5` ）、Quarkus BOMに link:https://search.maven.org/artifact/org.jetbrains.kotlin/kotlin-bom[Kotlin BOM] が含まれているため、バージョンを指定する必要はありません。

source: The Quarkus Kubernetes will bind the HTTP server using the port name `http` and the gRPC server using the port name `grpc`. By default, the Quarkus application will only expose the port name `http`, so only the HTTP server will be publicly accessible. To expose the gRPC server instead, set the `quarkus.kubernetes.ingress.target-port=grpc` property in your application.properties:
ja_jp: Quarkus Kubernetes は、ポート名 `http` を使用して HTTP サーバーをバインドし、ポート名 `grpc` を使用して gRPC サーバーをバインドします。デフォルトでは、Quarkus アプリケーションはポート名 `http` のみを公開するため、HTTP サーバーのみがパブリックにアクセス可能になります。代わりに gRPC サーバーを公開するには、application.properties で `quarkus.kubernetes.ingress.target-port=grpc` プロパティーを設定します。
